revk/ESP32-Flasher/main/Flasher.c
// Flasher
// See https://components.espressif.com/components/espressif/esp-serial-flasher/versions/1.3.1/examples/esp32_usb_cdc_acm_example?language=en

static const char TAG[] = "Flasher";

#include "revk.h"
#include "esp_sleep.h"
#include "esp_task_wdt.h"
#include <netdb.h>
#include <driver/gpio.h>
#include <driver/uart.h>
#include <driver/rtc_io.h>
#include <driver/sdmmc_host.h>
#include <sdmmc_cmd.h>
#include "esp_http_client.h"
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include "esp_crt_bundle.h"
#endif
#include "esp_vfs_fat.h"
#include <sys/dirent.h>
#include "usb/usb_host.h"
#include "usb/cdc_acm_host.h"
#include "esp_loader.h"
#include "esp32_usb_cdc_acm_port.h"
#include <math.h>

struct
{
   uint8_t die:1;               // Shutdown
   uint8_t wifi:1;              // WiFi connected
   uint8_t reload:1;            // Re load manifest, etc
   uint8_t forceerase:1;        // Force erase
   uint8_t voltage3v3:1;        // 3.3V not 5V
   uint8_t erase:1;             // Manifest says erase
   uint8_t nobtn:1;             // Disable button erase
   uint8_t nocheck:1;           // Disable check
   uint8_t connected:1;         // Connected
   uint8_t fileerror:1;         // File error
   uint8_t checked:1;           // Upgrade checked
} volatile b;
uint16_t manifests = 0;         // Bit map of manifests on SD
uint8_t progress = 0;           // Progress (LED)
char ledf = 'K',
   ledt = 'K',
   ledsd = 'B';                 // LED from/to and SD
uint8_t mac[6] = { 0 };         // Found mac
char chip[30] = { 0 };          // Found chip type

uint32_t badusb = 0;            // Last devices 0 even

uint32_t flashsize = 0;         // Found flash size

char *manifestjson = NULL;      // Loaded manifest JSON
uint32_t manifestsize = 0;      // Total flash bytes
jo_t j = NULL;                  // Parsed manifest JSON
char *manifestid = NULL;        // ID check
char *manifestsetting = NULL;   // Manifest setting object
uint32_t manifestsettinglen = 0;        // Len

#define	BLOCK	4096
uint8_t block[BLOCK];

#ifdef  CONFIG_TINYUSB_MSC_MOUNT_PATH
const char sd_dir[] = CONFIG_TINYUSB_MSC_MOUNT_PATH;
#else
const char sd_dir[] = "/sd";
#endif


led_strip_handle_t strip = NULL;

const char *
mqtt_client_callback (int client, const char *prefix, const char *target, const char *suffix, jo_t j)
{
   if (client || !prefix || target || strcmp (prefix, topiccommand) || !suffix)
      return NULL;              // Not for us or not a command from main MQTTS
   if (!strcmp (suffix, "wifi"))
      b.wifi = 1;
   return NULL;
}

void
led_task (void *arg)
{
   if (strip)
   {
      uint8_t tick = 0;
      while (!b.die)
      {
         tick++;
         uint32_t f = revk_rgb (ledf);
         uint32_t t = revk_rgb (ledt);
         uint8_t p = progress;
         if (f != t && p < 5)
            p = 5;              // don't do all off
         for (int i = 0; i < 10; i++)
         {
            uint8_t l = p;
            if (l > 10)
               l = 10;
            p -= l;
            if ((b.fileerror && (tick & 1)) || (f == t && i != progress / 10))
               led_strip_set_pixel (strip, i, 0, 0, 0); // Off
            else
               led_strip_set_pixel (strip, i,   //
                                    gamma8[l * ((t >> 16) & 255) / 10 + (10 - l) * ((f >> 16) & 255) / 10],     //
                                    gamma8[l * ((t >> 8) & 255) / 10 + (10 - l) * ((f >> 8) & 255) / 10],       //
                                    gamma8[l * ((t >> 0) & 255) / 10 + (10 - l) * ((f >> 0) & 255) / 10]);
         }
         if (b.fileerror && !(tick & 1))
            revk_led (strip, 10, 255, revk_rgb ('R'));
         else
            revk_led (strip, 10, 255, revk_rgb (ledsd));
         REVK_ERR_CHECK (led_strip_refresh (strip));
         usleep (100000);
      }
      for (int i = 0; i < 11; i++)
         revk_led (strip, i, 0, 0);
      REVK_ERR_CHECK (led_strip_refresh (strip));
   }
   vTaskDelete (NULL);
}

void
set_led (uint8_t p, char f, char t)
{                               // Set LED display state (if f==t then one LED at progress point)
   progress = p;
   if (f)
      ledf = f;
   if (t)
      ledt = t;
   //ESP_LOGE (TAG, "LED %c %c %d%%", ledf, ledt, progress);
}

void
btn_task (void *arg)
{
   if (btn.set)
   {
      while (!b.die)
      {
         if (revk_gpio_get (btn))
         {
            if (b.connected)
            {
               if (!b.nobtn)
               {
                  b.forceerase = 1;
                  b.reload = 1;
               }
            } else if (manifests)
            {
               uint8_t m = manifest;
               do
               {
                  m++;
                  if (m == 10)
                     m = 0;
               }
               while (!(manifests & (1 << m)));
               if (m != manifest)
               {
                  jo_t j = jo_object_alloc ();
                  jo_int (j, "manifest", m);
                  revk_setting (j);
                  jo_free (&j);
                  b.checked = 0;
                  b.reload = 1;
               }
            }
            while (revk_gpio_get (btn))
               usleep (100000);
            continue;
         }
         usleep (100000);
      }
   }
   vTaskDelete (NULL);
}

static void
usb_lib_task (void *arg)
{
   while (1)
   {
      uint32_t event_flags;
      usb_host_lib_handle_events (portMAX_DELAY, &event_flags);
      if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS)
         usb_host_device_free_all ();
      if (!event_flags)
      {
         usb_host_lib_info_t i;
         usb_host_lib_info (&i);
         if (i.num_devices)
            badusb = 0;
         else
            badusb = uptime ();
      }
   }
}

void
host_error_cb (void)
{
   ESP_LOGE (TAG, "Host error");
}

void
device_disconnect_cb (void)
{
   ESP_LOGE (TAG, "Device disconnect");
   b.connected = 0;
}

void
device_connect_cb (usb_device_handle_t usb_dev)
{
   ESP_LOGE (TAG, "Device connect");
   b.connected = 1;
}

enum
{
   STATUS_ERROR,
   STATUS_SILENT,               // no data
   STATUS_EMPTY,                // 0xffffffff error
   STATUS_LOOPING,              // Starting multiple times
   STATUS_FAIL,                 // ATE: FAIL
   STATUS_PASS,                 // ATE: PASS
   STATUS_TIMEOUT,              // Not looping but not pass/fail
} target_status (void)
{
   uint32_t to = uptime () + 5;
   char buf[100];
   uint8_t p = 0;
   uint8_t rst = 0;
   while (uptime () <= to)
   {
      uint8_t c;
      esp_loader_error_t e = loader_port_read (&c, 1, 100);
      if (e == ESP_LOADER_ERROR_TIMEOUT)
         continue;
      if (e)
         return STATUS_ERROR;
      if (c >= ' ')
      {
         if (p < sizeof (buf) - 1)
            buf[p++] = c;
         continue;
      }
      if (!p)
         continue;
      buf[p] = 0;
      p = 0;
      if (!strcmp (buf, "invalid header: 0xffffffff"))
         return STATUS_EMPTY;
      if (!strncmp (buf, "Build:", 6) && rst++ > 4)
         return STATUS_LOOPING;
      while (buf[p] >= 'A' && buf[p] <= 'Z')
         p++;
      if (buf[p] == ':')
      {
         printf ("%s\n", buf);
         buf[p++] = 0;
         while (buf[p] == ' ')
            p++;
         if (!strcmp (buf, "ATE"))
         {
            if (!strcmp (buf + p, "PASS"))
               return STATUS_PASS;
            if (!strcmp (buf + p, "FAIL"))
               return STATUS_FAIL;
         } else if (!strcmp (buf, "ID"))
         {
            // TODO check ID
            if (manifestsettinglen)
            {
               ESP_LOGE (TAG, "Setting %.*s", manifestsettinglen, manifestsetting);
               loader_port_write ((uint8_t *) manifestsetting, manifestsettinglen, 1000);
            }
         }
      }
      p = 0;
   }
   if (!rst)
      return STATUS_SILENT;
   return STATUS_TIMEOUT;
};

void
chip_info (void)
{                               // Get chip info
   const char *const chips[] =
      { "ESP8266", "ESP32", "ESP32S2", "ESP32C3", "ESP32S3", "ESP32C2", "ESP32C5", "ESP32H2", "ESP32C6", "ESP32P4", "ESP_MAX",
      "ESP_UNKNOWN"
   };
   char *c = chip;
   *c = 0;
   target_chip_t id = esp_loader_get_target ();
   if (id < sizeof (chips) / sizeof (*chips))
      c = stpcpy (c, chips[id]);
   uint8_t psram = 0;
   switch (id)
   {
   case ESP32S3_CHIP:
      {                         // We can get some more info...
         c = stpcpy (c, "MC");  // Always MC
         const uint32_t efuse = 0x60007000;
         const uint32_t block1 = efuse + 0x44;
         uint32_t r1,
           r2;
         if (!esp_loader_read_register (block1 + 12, &r1))
         {
            r1 = (r1 >> 21) & 7;
            if (r1 == 1)
               c = stpcpy (c, "PICO");
         }
         if (!esp_loader_read_register (block1 + 16, &r1) && !esp_loader_read_register (block1 + 20, &r2))
            psram = ((r1 >> 3) & 3) | ((r2 >> 17) & 4);
         break;
      }
   default:
      break;                    // Other chip types may be needed
   }
   flashsize = 0;
   if (!esp_loader_flash_detect_size (&flashsize) && flashsize)
      c += sprintf (c, "N%u", (uint8_t) (flashsize / 1024 / 1024));
   if (psram)
      c += sprintf (c, "R%u", psram);
   *c = 0;
   if (b.connected && !esp_loader_read_mac (mac))
      ESP_LOGE (TAG, "Chip %02X:%02X:%02X:%02X:%02X:%02X %s", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], chip);
}

void
close_manifest (void)
{
   if (!manifestjson)
      return;
   jo_free (&j);
   free (manifestjson);
   manifestjson = NULL;
}

typedef void manifest_t (char *filename, char *url, int f, uint32_t address, uint32_t size);

void
scan_manifest (manifest_t cb)
{
   if (!j)
      return;
   jo_rewind (j);
   if (jo_find (j, "flash") == JO_ARRAY)
   {
      while (jo_next (j) == JO_OBJECT)
      {
         uint32_t address = 0;
         char *filename = NULL;
         char *url = NULL;
         while (jo_next (j) == JO_TAG)
         {
            if (!jo_strcmp (j, "filename") && !filename)
            {
               if (jo_next (j) == JO_STRING)
                  filename = jo_strdup (j);
            } else if (!jo_strcmp (j, "url") && !url)
            {
               if (jo_next (j) == JO_STRING)
                  url = jo_strdup (j);
            } else if (!jo_strcmp (j, "address") && !url)
            {
               jo_type_t t = jo_next (j);
               if (t == JO_NUMBER)
                  address = jo_read_int (j);
               else if (t == JO_STRING)
               {
                  char *a = jo_strdup (j);
                  address = strtoul (a, NULL, 16);
                  free (a);
               }
            } else
               jo_next (j);
         }
         if (filename)
         {
            char *fn = NULL;
            if (asprintf (&fn, "%s/%s", sd_dir, filename) >= 0)
            {
               int f = open (fn, O_RDONLY);
               if (f >= 0)
               {
                  struct stat s = { 0 };
                  fstat (f, &s);
                  if (cb)
                     cb (filename, url, f, address, s.st_size);
                  close (f);
               } else if (cb)
                  cb (filename, url, -1, address, 0);
               free (fn);
            }
         } else if (cb)
            cb (filename, url, -1, address, 0);
         free (filename);
         free (url);
      }
   }
}

esp_http_client_handle_t client = NULL;

void
upgrade_check (int f, char *filename, char *url)
{
   if (!filename || !url)
      return;
   if (!client)
   {
      esp_http_client_config_t config = {
         .url = url,
         .timeout_ms = 30000,
      };
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
      config.crt_bundle_attach = esp_crt_bundle_attach;
#else
      config.use_global_ca_store = true;        /* Global cert */
#endif
      client = esp_http_client_init (&config);
      if (!client)
         return;
   } else
      esp_http_client_set_url (client, url);
   char *dl = NULL;
   asprintf (&dl, "%s/DOWNLOAD", sd_dir);
   char *fn = NULL;
   asprintf (&fn, "%s/%s", sd_dir, filename);
   esp_err_t e = 0;
   char *h = NULL;
   struct stat s = { 0 };
   if (!stat (fn, &s) && s.st_mtime)
   {
      struct tm t;
      gmtime_r (&s.st_mtime, &t);
      asprintf (&h, "%.3s, %02d %.3s %4d %02d:%02d:%02d GMT", "SunMonTueWedThuFriSat" + t.tm_wday * 3, t.tm_mday,
                "JanFebMarAprMayJunJulAugSepOctNovDec" + t.tm_mon * 3, t.tm_year + 1900, t.tm_hour, t.tm_min, t.tm_sec);
      e = esp_http_client_set_header (client, "If-Modified-Since", h);
   }
   if (!e)
      e = esp_http_client_open (client, 0);
   if (!e)
   {
      esp_http_client_fetch_headers (client);
      int status = esp_http_client_get_status_code (client);
      int len = 0;
      if (status / 100 == 2)
      {
         set_led (100, 'K', 'Y');
         b.fileerror = 1;
         int o = open (dl, O_CREAT | O_TRUNC | O_WRONLY, 0777);
         if (o < 0)
            ESP_LOGE (TAG, "Cannot write %s", dl);
         else
         {
            uint32_t size = 0;
            while (1)
            {
               len = esp_http_client_read_response (client, (void *) block, sizeof (block));
               if (len <= 0)
                  break;
               write (o, block, len);
               size += len;
            }
            close (o);
            if (!e)
               unlink (fn);     // fails is not there, duh
            if (!e && (e = rename (dl, fn)))
               ESP_LOGE (TAG, "Rename fail %s", fn);
            if (!e)
            {
               ESP_LOGE (TAG, "Upgraded %s %u", filename, size);
               b.reload = 1;
            }
         }
      } else
      {
         if (status != 304)
            ESP_LOGE (TAG, "Status %d %s", status, url);
         else
            ESP_LOGE (TAG, "Unchanged %s %s (%u)", h ? : "", filename, s.st_size);
      }
      esp_http_client_flush_response (client, &len);
   }
   if (e)
      ESP_LOGE (TAG, "Failed %s: %s", url, esp_err_to_name (e));
   if (h)
      esp_http_client_delete_header (client, "If-Modified-Since");
   free (h);
   free (dl);
   free (fn);
}


void
upgrade_cb (char *filename, char *url, int f, uint32_t address, uint32_t size)
{
   if (!size)
      manifestsize = -1;
   else if (manifestsize != 1)
      manifestsize += size;
   upgrade_check (f, filename, url);
}

void
load_cb (char *filename, char *url, int f, uint32_t address, uint32_t size)
{
   if (!size)
      manifestsize = -1;
   else if (manifestsize != 1)
      manifestsize += size;
}

